taylorCouette/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          56;
        startFace       3052;
    }
    bottom
    {
        type            patch;
        nFaces          56;
        startFace       3108;
    }
    rotatingWall
    {
        type            patch;
        nFaces          28;
        startFace       3164;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          28;
        startFace       3192;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3136;
        startFace       3220;
    }
)

// ************************************************************************* //
