taylorCouette/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     top
    {
	type  	slip;
    }
    bottom
    {
	type  	slip;
    }
     rotatingWall
    {
	type 		rotatingWallVelocity; 
	origin	 	(0 0 0);
	axis 		(0 1 0);
	omega 		1140;
    }
    wall
    {
	  type            rotatingWallVelocity;
        origin          ( 0 0 0 );
        axis            ( 0 1 0 );
        omega           0; // rad/s
    }
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
